interface Faculty {
  name: string;
  majors: string[];
}

export const faculties: Faculty[] = [
  {
    name: "คณะเกษตร",
    majors: [
      "การจัดการศัตรูพืชและสัตว์",
      "เกษตรเขตร้อน",
      "คหกรรมศาสตร์",
      "วิทยาศาสตร์เกษตร",
      "เคมีการเกษตร",
      "สัตวศาสตร์อุตสาหกรรม",
      "อาหารโภชนาการและการกำหนดอาหาร",
      "เทคโนโลยีระบบเกษตร",
    ],
  },
  {
    name: "คณะบริหารธุรกิจ",
    majors: [
      "การเงิน",
      "การตลาด",
      "การจัดการ",
      "การจัดการการผลิต",
      "หลักสูตรบัญชีบัณฑิต (หลักสูตรนานาชาติ)",
    ],
  },
  {
    name: "คณะประมง",
    majors: [
      "การจัดการประมง",
      "ชีววิทยาประมง",
      "ผลิตภัณฑ์ประมง",
      "เพาะเลี้ยงสัตว์น้ำ",
      "วิทยาศาสตร์ทางทะเล",
    ],
  },
  {
    name: "คณะมนุษยศาสตร์",
    majors: [
      "ปรัชญาและศาสนา",
      "ภาษาไทย",
      "ภาษาญี่ปุ่น",
      "ภาษาฝรั่งเศส",
      "ภาษาเยอรมัน",
      "ภาษาอังกฤษ",
      "วรรณคดี",
      "นวัตกรรมการท่องเที่ยว",
      "การจัดการการท่องเที่ยว",
      "นิเทศศาสตร์",
      "ดนตรีไทย",
      "ดนตรีตะวันตก",
      "ภาษาจีน",
      "ภาษาจีนธุรกิจ",
      "ภาษาไทยเพื่อการสื่อสารสำหรับชาวต่างประเทศ",
    ],
  },
  {
    name: "คณะวนศาสตร์",
    majors: [
      "วนศาสตร์",
      "วิทยาศาสตร์ชีวภาพป่าไม้",
      "เทคโนโลยีเยื่อและกระดาษ",
      "เทคโนโลยีผลิตภัณฑ์ไม้และกระดาษ",
    ],
  },
  {
    name: "คณะวิทยาศาสตร์",
    majors: [
      "คณิตศาสตร์",
      "สถิติ",
      "วิทยาการคอมพิวเตอร์",
      "ฟิสิกส์",
      "เคมี",
      "ชีวเคมี",
      "เคมีอุตสาหกรรม",
      "ชีววิทยา",
      "จุลชีววิทยา",
      "วิทยาศาสตร์ชีวภาพรังสี",
      "วิทยาศาสตร์นิวเคลียร์",
      "พฤกษศาสตร์",
      "พันธุศาสตร์",
      "วิทยาศาสตร์พื้นพิภพ",
      "เคมีบูรณาการ",
      "วิทยาศาสตร์ชีวภาพและเทคโนโลยี",
      "หลักสูตรเตรียมแพทย์ศาสตร์ ชั้นปีที่ 1",
    ],
  },
  {
    name: "คณะวิศวกรรมศาสตร์",
    majors: [
      "วิศวกรรมเครื่องกล",
      "วิศวกรรมไฟฟ้า",
      "วิศวกรรมไฟฟ้าเครื่องกลการผลิต",
      "วิศวกรรมโยธา",
      "วิศวกรรมโยธา-ทรัพยากรน้ำ",
      "วิศวกรรมอุตสาหการ",
      "วิศวกรรมเคมี",
      "วิศวกรรมสิ่งแวดล้อม",
      "วิศวกรรมคอมพิวเตอร์",
      "วิศวกรรมซอฟต์แวร์และความรู้",
      "วิศวกรรมวัสดุ",
      "วิศวกรรมการบินและอวกาศ",
      "การจัดการเทคโนโลยีการบิน",
      "วิศวกรรมสำรวจและสารสนเทศภูมิศาสตร์",
    ],
  },
  {
    name: "คณะศึกษาศาสตร์",
    majors: ["ศึกษาศาสตร์", "สุขศึกษา", "พลศึกษา"],
  },
  {
    name: "คณะเศรษฐศาสตร์",
    majors: [
      "เศรษฐศาสตร์",
      "เศรษฐศาสตร์การประกอบการ",
      "เศรษฐศาสตร์เกษตรและทรัพยากร",
      "เศรษฐศาสตร์สหกรณ์",
      "ธุรกิจการเกษตร",
    ],
  },
  {
    name: "คณะสถาปัตยกรรมศาสตร์",
    majors: [
      "สถาปัตยกรรมศาสตรบัณฑิต",
      "ภูมิสถาปัตยกรรมศาสตรบัณฑิต",
      "วิทยาศาสตรบัณฑิต สาขานวัตกรรมการออกแบบผลิตภัณฑ์เชิงบูรณาการ",
    ],
  },
  {
    name: "คณะสังคมศาสตร์",
    majors: [
      "ประวัติศาสตร์",
      "ภูมิศาสตร์",
      "เอเชียตะวันออกเฉียงใต้ศึกษา",
      "สังคมวิทยาและมานุษยวิทยา",
      "จิตวิทยา",
      "นิติศาสตร",
      "รัฐศาสตร์",
      "รัฐประศาสนศาสตร์",
    ],
  },
  {
    name: "คณะสัตวแพทยศาสตร์",
    majors: ["สัตวแพทยศาสตร"],
  },
  {
    name: "คณะอุตสาหกรรมเกษตร",
    majors: [
      "เทคโนโลยีชีวภาพ",
      "วิศวกรรมอาหาร",
      "พัฒนาผลิตภัณฑ์อุตสาหกรรมเกษตร",
      "เทคโนโลยีการบรรจุ",
      "วิทยาศาสตร์และเทคโนโลยีการอาหาร",
      "วิทยาศาสตร์และเทคโนโลยีสิ่งทอ",
      "นวัตกรรมและเทคโนโลยีอุตสาหกรรมเกษตร",
    ],
  },
  {
    name: "คณะเทคนิคการสัตวแพทย์",
    majors: ["การพยาบาลสัตว์", "เทคนิคการสัตวแพทย์"],
  },
  {
    name: "คณะสิ่งแวดล้อม",
    majors: ["วิทยาศาสตร์และเทคโนโลยีสิ่งแวดล้อม"],
  },
  {
    name: "คณะวิทยาลัยพยาบาลบรมราชชนนี นพรัตน์วชิระ",
    majors: ["พยาบาลศาสตรบัณฑิต", "พยาบาลวิทยาศาสตรบัณฑิต"],
  },
];
